# Kristen Finley Module 4 Project: Task 2

---

## Task 1 - Create DataFrame

In [56]:
import pandas as pd
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]} 
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

1. Followed the instructions in 7.14.2 to import pandas as pd and created a pandas DataFrame from a dictionary (a set of key-value pairs) holding multiple exam scores for each key/student. Noted: In this example, there are 5 students, each with 3 exam scores, but the scores aren't labeled.

---

## Task 2 -- Custom Index

In [57]:
grades.index =['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

1. Followed the instructions to apply a custom index (instead of 0,1,2), called them 'Test1', Test2', and 'Test3'.

In [58]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

2. Requested grades by key using the text attribute (square brackets with single quoted text strings). Found Eva's grades with grades['Eva']

In [59]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

3. Noted: If no spaces in the key, the simpler dot attribute approach can be used. Found Sam's grades with grades.Sam as shown in 'Accessing a DataFrame's columns' subsection.

---

## Task 3a -- Accessing Rows (loc, iloc)

1. Noted: Like spreadsheets, we can access specific rows or columns.
2. Noted: We use loc['ColA'] and iloc[i] to access rows by name and index, respectively.

In [60]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

3. Executed the examples using loc['Test1'] to get scores for the first exam, or iLoc[0] to get scores for the first exam and iLoc[1] to get scores for the second exam. 
- Answered Question: "Which do you prefer?"
- I have yet to form a preference when accessing rows using loc or iloc.

In [61]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [62]:
grades.iloc[0:3]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

4. Noted: We can also get slices of rows, e.g., from ['Test1':'Test3'], inclusive, or, using index values, from [0:2], inclusive.

---

1. Noted: Like spreadsheets, we can access specific rows or columns.
2. Noted: We use loc['ColA'] and iloc[i] to access rows by name and index, respectively.

In [63]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [64]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

3. Executed the examples using loc['Test1'] to get scores for the first exam, or iLoc[0] to get scores for the first exam and iLoc[1] to get scores for the second exam. 
- Answered Question: "Which do you prefer?"
- I have not formed a preference for this.

In [65]:
grades.iloc[0:3]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

4. Noted: We can also get slices of rows, e.g., from ['Test1':'Test3'], inclusive, or, using index values, from [0:2], inclusive.

---

## Task 3b -- Accessing Subsets (at, iat)

1. Noted: We can use similar notation to get a single cell in the DataFrame (much like getting a single cell in a spreadsheet).

In [66]:
grades.at['Test2', 'Eva']

87

2. Used grades.at['Test2', 'Eva'} to find her score on the second exam using labels.

In [67]:
grades.iat[2, 0]

70

3. Used grades.iat[2,0] to get the score on the third exam for the first student (Wally), using indices.

## Task 4 -- Describe (By Column)

In [68]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

1. Used grades.describe() to get descriptive statistics for our gradebook columns.
2. Noted that learning Python and DataFrames can be powerful.

In [69]:
pd.set_option('display.precision', 2)
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

3. Tried to set the precision using the pd.set_option('precision',2) provided.
4. Answered Question. "Does it work?" Noted: Libraries are evolving. If you get an error, copy the error text and do a web search.
- Error occured.
- Google search stated "The following will not work because it matches multiple option names, e.g. display.max_colwidth, display.max_rows, display.max_columns:"
5. Answered "Can you find something about a newer option using "display.precision"?"
- source: https://pandas.pydata.org/docs/user_guide/options.html
6. Tried pd.set_option("display.precision",2).
- Adding "display." before precision corrected error.
7. Noted: Being able to debug evolving features on your own is important for success.
8. Noted: Our field, languages, and libraries are constantly evolving.

---

## Task 5 -- Transpose (rows <--> columns)

In [70]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

1. TGot the average for each column by calling grades.mean()

In [71]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

2. Transposed the DataFrame using the T attribute.

In [72]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    92.80  81.20  83.40
std      7.66  11.54   8.23
min     83.00  65.00  70.00
25%     87.00  77.00  82.00
50%     94.00  81.00  85.00
75%    100.00  87.00  90.00
max    100.00  96.00  90.00

3. Got the mean by the new columns with .T.describe()

In [73]:
grades.T.mean()

Test1    92.8
Test2    81.2
Test3    83.4
dtype: float64

---

## Task 6 -- Sort

In [74]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

1. Sorted the gradebook rows in reverse order so the most recent exam row appears at the top with grades.sort_index(ascending=False)

In [75]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

2. Sorted the gradebook columns so the names appear in order using grades.sort_index(axis=1).

In [76]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2   87     81   77     96   65
Test3   90     82   90     70   85

In [77]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100     87     90
Katie    100     81     82
Sam       94     77     90
Wally     87     96     70
Bob       83     65     85

3. Noted and added examples: We can sort our data pretty much however we like.

---

Made sure the notebook was nicely formatted with a heading and sections in Markdown clearly dividing the work.

Ran the entire file and export the results to yourname_2.html. This will display your calculated results.